ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32WBxx/stm32wb30xx.h
/********************  Bit definition for RCC_CRRCR register  *******************/
#define RCC_CRRCR_HSI48ON_Pos               (0U)                               
#define RCC_CRRCR_HSI48ON_Msk               (0x1UL << RCC_CRRCR_HSI48ON_Pos)    /*!< 0x00000001 */
#define RCC_CRRCR_HSI48ON                   RCC_CRRCR_HSI48ON_Msk               
#define RCC_CRRCR_HSI48RDY_Pos              (1U)                               
#define RCC_CRRCR_HSI48RDY_Msk              (0x1UL << RCC_CRRCR_HSI48RDY_Pos)   /*!< 0x00000002 */
#define RCC_CRRCR_HSI48RDY                  RCC_CRRCR_HSI48RDY_Msk              
#define RCC_CRRCR_HSI48CAL_Pos              (7U)                               
#define RCC_CRRCR_HSI48CAL_Msk              (0x1FFUL << RCC_CRRCR_HSI48CAL_Pos) /*!< 0x0000FF80 */
#define RCC_CRRCR_HSI48CAL                  RCC_CRRCR_HSI48CAL_Msk              
#define RCC_CRRCR_HSI48CAL_0                (0x001U << RCC_CRRCR_HSI48CAL_Pos)  /*!< 0x00000080 */
#define RCC_CRRCR_HSI48CAL_1                (0x002U << RCC_CRRCR_HSI48CAL_Pos)  /*!< 0x00000100 */
#define RCC_CRRCR_HSI48CAL_2                (0x004U << RCC_CRRCR_HSI48CAL_Pos)  /*!< 0x00000200 */
#define RCC_CRRCR_HSI48CAL_3                (0x008U << RCC_CRRCR_HSI48CAL_Pos)  /*!< 0x00000400 */
#define RCC_CRRCR_HSI48CAL_4                (0x010U << RCC_CRRCR_HSI48CAL_Pos)  /*!< 0x00000800 */
#define RCC_CRRCR_HSI48CAL_5                (0x020U << RCC_CRRCR_HSI48CAL_Pos)  /*!< 0x00001000 */
#define RCC_CRRCR_HSI48CAL_6                (0x040U << RCC_CRRCR_HSI48CAL_Pos)  /*!< 0x00002000 */
#define RCC_CRRCR_HSI48CAL_7                (0x080U << RCC_CRRCR_HSI48CAL_Pos)  /*!< 0x00004000 */
#define RCC_CRRCR_HSI48CAL_8                (0x100U << RCC_CRRCR_HSI48CAL_Pos)  /*!< 0x00008000 */

/********************  Bit definition for RCC_HSECR register  *******************/
#define RCC_HSECR_UNLOCKED_Pos              (0U)                               
#define RCC_HSECR_UNLOCKED_Msk              (0x1UL << RCC_HSECR_UNLOCKED_Pos)  /*!< 0x00000001 */
#define RCC_HSECR_UNLOCKED                  RCC_HSECR_UNLOCKED_Msk             

#define RCC_HSECR_HSES_Pos                  (3U)                               
#define RCC_HSECR_HSES_Msk                  (0x1UL << RCC_HSECR_HSES_Pos)      /*!< 0x00000008 */
#define RCC_HSECR_HSES                      RCC_HSECR_HSES_Msk                 

#define RCC_HSECR_HSEGMC_Pos                (4U)                               
#define RCC_HSECR_HSEGMC_Msk                (0x7UL << RCC_HSECR_HSEGMC_Pos)       /*!< 0x00000070 */
#define RCC_HSECR_HSEGMC                    RCC_HSECR_HSEGMC_Msk                  
#define RCC_HSECR_HSEGMC0_Pos               (4U)                               
#define RCC_HSECR_HSEGMC0_Msk               (0x1UL << RCC_HSECR_HSEGMC0_Pos)      /*!< 0x00000010 */
#define RCC_HSECR_HSEGMC0                   RCC_HSECR_HSEGMC0_Msk                 
#define RCC_HSECR_HSEGMC1_Pos               (5U)                               
#define RCC_HSECR_HSEGMC1_Msk               (0x1UL << RCC_HSECR_HSEGMC1_Pos)      /*!< 0x00000020 */
#define RCC_HSECR_HSEGMC1                   RCC_HSECR_HSEGMC1_Msk                 
#define RCC_HSECR_HSEGMC2_Pos               (6U)                               
#define RCC_HSECR_HSEGMC2_Msk               (0x1UL << RCC_HSECR_HSEGMC2_Pos)      /*!< 0x00000040 */
#define RCC_HSECR_HSEGMC2                   RCC_HSECR_HSEGMC2_Msk                 

#define RCC_HSECR_HSETUNE_Pos              (8U)                               
#define RCC_HSECR_HSETUNE_Msk              (0x3FUL << RCC_HSECR_HSETUNE_Pos)   /*!< 0x00003F00 */
#define RCC_HSECR_HSETUNE                  RCC_HSECR_HSETUNE_Msk              
#define RCC_HSECR_HSETUNE0_Pos             (8U)                               
#define RCC_HSECR_HSETUNE0_Msk             (0x1UL << RCC_HSECR_HSETUNE0_Pos)   /*!< 0x00000100 */
#define RCC_HSECR_HSETUNE0                 RCC_HSECR_HSETUNE0_Msk              
#define RCC_HSECR_HSETUNE1_Pos             (9U)                               
#define RCC_HSECR_HSETUNE1_Msk             (0x1UL << RCC_HSECR_HSETUNE1_Pos)   /*!< 0x00000200 */
#define RCC_HSECR_HSETUNE1                 RCC_HSECR_HSETUNE1_Msk              
#define RCC_HSECR_HSETUNE2_Pos             (10U)                              
#define RCC_HSECR_HSETUNE2_Msk             (0x1UL << RCC_HSECR_HSETUNE2_Pos)   /*!< 0x00000400 */
#define RCC_HSECR_HSETUNE2                 RCC_HSECR_HSETUNE2_Msk              
#define RCC_HSECR_HSETUNE3_Pos             (11U)                              
#define RCC_HSECR_HSETUNE3_Msk             (0x1UL << RCC_HSECR_HSETUNE3_Pos)   /*!< 0x00000800 */
#define RCC_HSECR_HSETUNE3                 RCC_HSECR_HSETUNE3_Msk              
#define RCC_HSECR_HSETUNE4_Pos             (12U)                              
#define RCC_HSECR_HSETUNE4_Msk             (0x1UL << RCC_HSECR_HSETUNE4_Pos)   /*!< 0x00001000 */
#define RCC_HSECR_HSETUNE4                 RCC_HSECR_HSETUNE4_Msk              
#define RCC_HSECR_HSETUNE5_Pos             (13U)                              
#define RCC_HSECR_HSETUNE5_Msk             (0x1UL << RCC_HSECR_HSETUNE5_Pos)   /*!< 0x00002000 */
#define RCC_HSECR_HSETUNE5                 RCC_HSECR_HSETUNE5_Msk              

/********************  Bit definition for RCC_EXTCFGR register  *******************/
#define RCC_EXTCFGR_SHDHPRE_Pos             (0U)                               
#define RCC_EXTCFGR_SHDHPRE_Msk             (0xFUL << RCC_EXTCFGR_SHDHPRE_Pos) /*!< 0x0000000F */
#define RCC_EXTCFGR_SHDHPRE                 RCC_EXTCFGR_SHDHPRE_Msk            
#define RCC_EXTCFGR_SHDHPRE_0               (0x1U << RCC_EXTCFGR_SHDHPRE_Pos)  /*!< 0x00000001 */
#define RCC_EXTCFGR_SHDHPRE_1               (0x2U << RCC_EXTCFGR_SHDHPRE_Pos)  /*!< 0x00000002 */
#define RCC_EXTCFGR_SHDHPRE_2               (0x4U << RCC_EXTCFGR_SHDHPRE_Pos)  /*!< 0x00000004 */
#define RCC_EXTCFGR_SHDHPRE_3               (0x8U << RCC_EXTCFGR_SHDHPRE_Pos)  /*!< 0x00000008 */

#define RCC_EXTCFGR_C2HPRE_Pos              (4U)                               
#define RCC_EXTCFGR_C2HPRE_Msk              (0xFUL << RCC_EXTCFGR_C2HPRE_Pos) /*!< 0x000000F0 */
#define RCC_EXTCFGR_C2HPRE                  RCC_EXTCFGR_C2HPRE_Msk           
#define RCC_EXTCFGR_C2HPRE_0                (0x1U << RCC_EXTCFGR_C2HPRE_Pos) /*!< 0x00000010 */
#define RCC_EXTCFGR_C2HPRE_1                (0x2U << RCC_EXTCFGR_C2HPRE_Pos) /*!< 0x00000020 */
#define RCC_EXTCFGR_C2HPRE_2                (0x4U << RCC_EXTCFGR_C2HPRE_Pos) /*!< 0x00000040 */
#define RCC_EXTCFGR_C2HPRE_3                (0x8U << RCC_EXTCFGR_C2HPRE_Pos) /*!< 0x00000080 */

#define RCC_EXTCFGR_SHDHPREF_Pos            (16U)                              
#define RCC_EXTCFGR_SHDHPREF_Msk            (0x1UL << RCC_EXTCFGR_SHDHPREF_Pos) /*!< 0x00010000 */
#define RCC_EXTCFGR_SHDHPREF                RCC_EXTCFGR_SHDHPREF_Msk           
#define RCC_EXTCFGR_C2HPREF_Pos             (17U)                              
#define RCC_EXTCFGR_C2HPREF_Msk             (0x1UL << RCC_EXTCFGR_C2HPREF_Pos) /*!< 0x00020000 */
#define RCC_EXTCFGR_C2HPREF                 RCC_EXTCFGR_C2HPREF_Msk          
#define RCC_EXTCFGR_RFCSS_Pos               (20U)                              
#define RCC_EXTCFGR_RFCSS_Msk               (0x1UL << RCC_EXTCFGR_RFCSS_Pos)   /*!< 0x00100000 */
#define RCC_EXTCFGR_RFCSS                   RCC_EXTCFGR_RFCSS_Msk              

/********************  Bit definition for RCC_C2AHB1ENR register  ****************/
#define RCC_C2AHB1ENR_DMA1EN_Pos            (0U)                               
#define RCC_C2AHB1ENR_DMA1EN_Msk            (0x1UL << RCC_C2AHB1ENR_DMA1EN_Pos) /*!< 0x00000001 */
#define RCC_C2AHB1ENR_DMA1EN                RCC_C2AHB1ENR_DMA1EN_Msk          
#define RCC_C2AHB1ENR_DMAMUX1EN_Pos         (2U)                               
#define RCC_C2AHB1ENR_DMAMUX1EN_Msk         (0x1UL << RCC_C2AHB1ENR_DMAMUX1EN_Pos) /*!< 0x00000004 */
#define RCC_C2AHB1ENR_DMAMUX1EN             RCC_C2AHB1ENR_DMAMUX1EN_Msk        
#define RCC_C2AHB1ENR_SRAM1EN_Pos           (9U)                               
#define RCC_C2AHB1ENR_SRAM1EN_Msk           (0x1UL << RCC_C2AHB1ENR_SRAM1EN_Pos) /*!< 0x00000200 */
#define RCC_C2AHB1ENR_SRAM1EN                RCC_C2AHB1ENR_SRAM1EN_Msk        
#define RCC_C2AHB1ENR_CRCEN_Pos             (12U)                              
#define RCC_C2AHB1ENR_CRCEN_Msk             (0x1UL << RCC_C2AHB1ENR_CRCEN_Pos) /*!< 0x00001000 */
#define RCC_C2AHB1ENR_CRCEN                  RCC_C2AHB1ENR_CRCEN_Msk           

